const branches: { [key: string]: string } = {
  "95": "فرع قريش - جدة",
  "124": "فرع قريش - جدة",
  "129": "فرع قريش - جدة",
  "130": "فرع قريش - جدة",
  "22": "فرع العزيزية - مكة",
  "75": "فرع العزيزية - مكة",
  "103": "فرع العزيزية - مكة",
  "23": "فرع الكعكية - مكة",
  "72": "فرع الكعكية - مكة",
  "94": "فرع طريق المدينة - جدة",
  "117": "فرع طريق المدينة - جدة",
  "31": "فرع النزهة - مكة",
  "38": "فرع النزهة - مكة",
  "91": "فرع النزهة - مكة",
  "119": "فرع النزهة - مكة",
  "120": "فرع النزهة - مكة",
  "125": "فرع النزهة - مكة",
  "136": "فرع النزهة - مكة",
  "49": "فرع اُبحر - جدة",
  "126": "فرع اُبحر - جدة",
};
export function getBranchNameByEmpId(empId: number) {
  return branches[String(empId)] || "Unknown Branch";
}
export default branches;
